
company数据库:
	|--dept:部门表
		|--`deptno` 部门编号
		|--`dname`  部门名称
		|--`loc`    部门所在地址
  

	|--employees:员工表
		|--`empno`	员工编号
		|--`ename`	员工姓名
		|--`job`	工作
		|--`MGR`	上级领导
		|--`hiredate`   入职日期
		|--`sal`	薪资
		|--`comm`       将金
		|--`deptno`     部门编号

/*
	1. 查询出部门编号为30的所有员工
	select * from t_employees where deptno = 30;
+-------+--------+----------+------+------------+---------+---------+--------+
| empno | ename  | job      | MGR  | hiredate   | sal     | comm    | deptno |
+-------+--------+----------+------+------------+---------+---------+--------+
|  7499 | allen  | salesman | 7698 | 1982-03-21 | 1600.00 |  300.00 |     30 |
|  7521 | ward   | salesman | 7698 | 1983-03-21 | 1250.00 |  500.00 |     30 |
|  7654 | martin | salesman | 7698 | 1981-03-21 | 1250.00 | 1400.00 |     30 |
|  7698 | blake  | maanger  | 7839 | 1981-03-21 | 2850.00 | NULL    |     30 |
|  7844 | turner | salesman | 7698 | 1989-03-21 | 1500.00 |    0.00 |     30 |
+-------+--------+----------+------+------------+---------+---------+--------+
	2. 所有销售员的姓名、编号和部门编号。
	select ename, empno, deptno from t_employees where job = 'salesman';
+--------+-------+--------+
| ename  | empno | deptno |
+--------+-------+--------+
| allen  |  7499 |     30 |
| ward   |  7521 |     30 |
| martin |  7654 |     30 |
| turner |  7844 |     30 |
+--------+-------+--------+
	3. 找出奖金高于工资的员工。
	select * from t_employees where sal < comm;
+-------+--------+----------+------+------------+---------+---------+--------+
| empno | ename  | job      | MGR  | hiredate   | sal     | comm    | deptno |
+-------+--------+----------+------+------------+---------+---------+--------+
|  7654 | martin | salesman | 7698 | 1981-03-21 | 1250.00 | 1400.00 |     30 |
+-------+--------+----------+------+------------+---------+---------+--------+
	4. 找出奖金高于工资60%的员工。
	select * from t_employees where comm >= sal * 1.6;
Empty set
	5. 找出部门编号为10中所有经理，和部门编号为20中所有销售员的详细资料。
	select * from t_employees where (deptno = 10 and job = 'manager') or (deptno = 20 and job = 'salesman');
+-------+-------+---------+------+------------+---------+------+--------+
| empno | ename | job     | MGR  | hiredate   | sal     | comm | deptno |
+-------+-------+---------+------+------------+---------+------+--------+
|  7782 | clack | manager | 7839 | 1985-03-21 | 2450.00 | NULL |     10 |
+-------+-------+---------+------+------------+---------+------+--------+
	6. 找出部门编号为10中所有经理，部门编号为20中所有销售员，还有即不是经理又不是销售员但其工资大或等于2000的所有员工详细资料。
	select * from t_employees where (deptno = 10 and job = 'manager') or (deptno = 20 and job = 'salesman') or (job != 'manager' and job != 'salesman' and sal >= 2000);
+-------+-------+-----------+------+------------+---------+------+--------+
| empno | ename | job       | MGR  | hiredate   | sal     | comm | deptno |
+-------+-------+-----------+------+------------+---------+------+--------+
|  7698 | blake | maanger   | 7839 | 1981-03-21 | 2850.00 | NULL |     30 |
|  7782 | clack | manager   | 7839 | 1985-03-21 | 2450.00 | NULL |     10 |
|  7788 | scott | anlayst   | 7566 | 1981-03-21 | 3000.00 | NULL |     10 |
|  7839 | king  | president | NULL | 1981-03-21 | 5000.00 | NULL |     10 |
|  7902 | ford  | analyst   | 7566 | 2021-01-01 | 3000.00 | NULL |     20 |
+-------+-------+-----------+------+------------+---------+------+--------+
	7. 无奖金或奖金低于1000的员工。
	select * from t_employees where comm is NULL or comm <1000;
+-------+--------+-----------+------+------------+---------+--------+--------+
| empno | ename  | job       | MGR  | hiredate   | sal     | comm   | deptno |
+-------+--------+-----------+------+------------+---------+--------+--------+
|  7369 | smith  | clerk     | 7902 | 1981-03-21 |  800.00 | NULL   |     20 |
|  7499 | allen  | salesman  | 7698 | 1982-03-21 | 1600.00 | 300.00 |     30 |
|  7521 | ward   | salesman  | 7698 | 1983-03-21 | 1250.00 | 500.00 |     30 |
|  7566 | jones  | manager   | 7839 | 1981-03-21 | 2975.00 | NULL   |     20 |
|  7698 | blake  | maanger   | 7839 | 1981-03-21 | 2850.00 | NULL   |     30 |
|  7782 | clack  | manager   | 7839 | 1985-03-21 | 2450.00 | NULL   |     10 |
|  7788 | scott  | anlayst   | 7566 | 1981-03-21 | 3000.00 | NULL   |     10 |
|  7839 | king   | president | NULL | 1981-03-21 | 5000.00 | NULL   |     10 |
|  7844 | turner | salesman  | 7698 | 1989-03-21 | 1500.00 |   0.00 |     30 |
|  7876 | adams  | clerk     | 7788 | 1998-03-21 | 1100.00 | NULL   |     20 |
|  7902 | ford   | analyst   | 7566 | 2021-01-01 | 3000.00 | NULL   |     20 |
|  7934 | miller | clerk     | 7782 | 1981-03-21 | 1300.00 | NULL   |     10 |
+-------+--------+-----------+------+------------+---------+--------+--------+
	8. 查询名字由三个字组成的员工。
	select * from t_employees where ename like '___';
Empty set
	9.查询2000年入职的员工。
	select * from t_employees where hiredate like '2000%';
Empty set
	10. 查询所有员工详细信息，用编号升序排序
	select * from t_employees order by empno asc;
+-------+--------+-----------+------+------------+---------+---------+--------+
| empno | ename  | job       | MGR  | hiredate   | sal     | comm    | deptno |
+-------+--------+-----------+------+------------+---------+---------+--------+
|  7369 | smith  | clerk     | 7902 | 1981-03-21 |  800.00 | NULL    |     20 |
|  7499 | allen  | salesman  | 7698 | 1982-03-21 | 1600.00 |  300.00 |     30 |
|  7521 | ward   | salesman  | 7698 | 1983-03-21 | 1250.00 |  500.00 |     30 |
|  7566 | jones  | manager   | 7839 | 1981-03-21 | 2975.00 | NULL    |     20 |
|  7654 | martin | salesman  | 7698 | 1981-03-21 | 1250.00 | 1400.00 |     30 |
|  7698 | blake  | maanger   | 7839 | 1981-03-21 | 2850.00 | NULL    |     30 |
|  7782 | clack  | manager   | 7839 | 1985-03-21 | 2450.00 | NULL    |     10 |
|  7788 | scott  | anlayst   | 7566 | 1981-03-21 | 3000.00 | NULL    |     10 |
|  7839 | king   | president | NULL | 1981-03-21 | 5000.00 | NULL    |     10 |
|  7844 | turner | salesman  | 7698 | 1989-03-21 | 1500.00 |    0.00 |     30 |
|  7876 | adams  | clerk     | 7788 | 1998-03-21 | 1100.00 | NULL    |     20 |
|  7902 | ford   | analyst   | 7566 | 2021-01-01 | 3000.00 | NULL    |     20 |
|  7934 | miller | clerk     | 7782 | 1981-03-21 | 1300.00 | NULL    |     10 |
+-------+--------+-----------+------+------------+---------+---------+--------+
	11. 查询所有员工详细信息，用工资降序排序，如果工资相同使用入职日期升序排序
	select * from t_employees order by sal desc, hiredate asc;
+-------+--------+-----------+------+------------+---------+---------+--------+
| empno | ename  | job       | MGR  | hiredate   | sal     | comm    | deptno |
+-------+--------+-----------+------+------------+---------+---------+--------+
|  7839 | king   | president | NULL | 1981-03-21 | 5000.00 | NULL    |     10 |
|  7788 | scott  | anlayst   | 7566 | 1981-03-21 | 3000.00 | NULL    |     10 |
|  7902 | ford   | analyst   | 7566 | 2021-01-01 | 3000.00 | NULL    |     20 |
|  7566 | jones  | manager   | 7839 | 1981-03-21 | 2975.00 | NULL    |     20 |
|  7698 | blake  | maanger   | 7839 | 1981-03-21 | 2850.00 | NULL    |     30 |
|  7782 | clack  | manager   | 7839 | 1985-03-21 | 2450.00 | NULL    |     10 |
|  7499 | allen  | salesman  | 7698 | 1982-03-21 | 1600.00 |  300.00 |     30 |
|  7844 | turner | salesman  | 7698 | 1989-03-21 | 1500.00 |    0.00 |     30 |
|  7934 | miller | clerk     | 7782 | 1981-03-21 | 1300.00 | NULL    |     10 |
|  7654 | martin | salesman  | 7698 | 1981-03-21 | 1250.00 | 1400.00 |     30 |
|  7521 | ward   | salesman  | 7698 | 1983-03-21 | 1250.00 |  500.00 |     30 |
|  7876 | adams  | clerk     | 7788 | 1998-03-21 | 1100.00 | NULL    |     20 |
|  7369 | smith  | clerk     | 7902 | 1981-03-21 |  800.00 | NULL    |     20 |
+-------+--------+-----------+------+------------+---------+---------+--------+
	12. 查询每个部门的平均工资
	select deptno, avg(sal) from t_employees group by deptno;
+--------+-------------+
| deptno | avg(sal)    |
+--------+-------------+
|     10 | 2937.500000 |
|     20 | 1968.750000 |
|     30 | 1690.000000 |
+--------+-------------+
	13. 查询每个部门的雇员数量。
	select deptno, count(ename) from t_employees group by deptno;
+--------+--------------+
| deptno | count(ename) |
+--------+--------------+
|     10 |            4 |
|     20 |            4 |
|     30 |            5 |
+--------+--------------+
	14. 查询每种工作的最高工资、最低工资、人数
	select job, max(sal), min(sal), count(ename) from t_employees group by job;
+-----------+----------+----------+--------------+
| job       | max(sal) | min(sal) | count(ename) |
+-----------+----------+----------+--------------+
| clerk     |  1300.00 |   800.00 |            3 |
| salesman  |  1600.00 |  1250.00 |            4 |
| manager   |  2975.00 |  2450.00 |            2 |
| maanger   |  2850.00 |  2850.00 |            1 |
| anlayst   |  3000.00 |  3000.00 |            1 |
| president |  5000.00 |  5000.00 |            1 |
| analyst   |  3000.00 |  3000.00 |            1 |
+-----------+----------+----------+--------------+
*/

